Show / Hide Table of Contents
Namespace IdeaRS.OpenModel.Detail
Classes
Beam
Representation of 1D member in IDEA StatiCa Detail
BentUpBar
Representing bent-Up bar in IDEA StatiCa Detail
DappedEnd
Representation of dapped end in IDEA StatiCa Detail
Hanging
Representing hanging in IDEA StatiCa Detail
HangingAroundPatch
Representing of hanging hanging around patch load/support in IDEA StatiCa Detail
ISDImportSettings
Represents settings of improt options into Idea StatiCa Detail
ISDModel
Model of IDEA StatiCa Detail
ISDSetting
IDEA StatiCa Detail setting
LineSupport
Line support
Opening
Representation of opening in IDEA StatiCa Detail
OpeningCirc
Representation of circular opening in IDEA StatiCa Detail
OpeningRect
Representation of rectangular opening in IDEA StatiCa Detail
OpeningRectOffsets
Representation of rectangular opening in IDEA StatiCa Detail
PatchDevice
Abstract class of patch support/load
PatchLoad
Representation of patch load in IDEA StatiCa Detail
PatchSupport
Representation of patch support in IDEA StatiCa Detail
ReinfAroundOpening
Representing reinforcement around opening in IDEA StatiCa Detail
ReinfBarByPolyline
Representing reinforcement bar input by polyline in IDEA StatiCa Detail
ReinfBarByTwoPoints
Representing reinforcement bar input by two points in IDEA StatiCa Detail
ReinfBarInclined
Representing reinforcement inclined bar in IDEA StatiCa Detail
ReinfBarOnEdge
Representing reinforcement bar input on edge in IDEA StatiCa Detail
ReinfBarOnMoreEdges
Representing reinforcement bar input on more edges in IDEA StatiCa Detail
ReinfFabric
Representing fabric reinforcement in IDEA StatiCa Detail
Reinforcement
Base class representing reinforcement in IDEA StatiCa Detail
ReinforcementGroup
Base class representing group reinforcement in IDEA StatiCa Detail
Wall
Representation of Wall in IDEA StatiCa Detail
WallRect
Representation of rectangular element2D in IDEA StatiCa Detail
Interfaces
IGeometryPart
Geotery interface
Enums
BarEndExtendType
Type of extension of bar
DappedEndHaunchType
Type of haunch on dapped end
EdgeOrientationType
Edge position type
EdgePositionType
Position of reinforcement on edge
HangingType
Type of hanging
InclinedReinfBarType
Type of inclined bar
ISDType
Type of IDEA StatiCa Detail
LoadDirection
Direction of load
LongReinfEndType
End type of longitudional reinforcement
TypeEdgePosition
Type edge position